modm-ext/archive-stmicro-svd/header_stm32l4s9aii6.svd
      <register>
        <name>LUT.1187</name>
        <addressOffset>0x228c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1188</name>
        <addressOffset>0x2290</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1189</name>
        <addressOffset>0x2294</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1190</name>
        <addressOffset>0x2298</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1191</name>
        <addressOffset>0x229c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1192</name>
        <addressOffset>0x22a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1193</name>
        <addressOffset>0x22a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1194</name>
        <addressOffset>0x22a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1195</name>
        <addressOffset>0x22ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1196</name>
        <addressOffset>0x22b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1197</name>
        <addressOffset>0x22b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1198</name>
        <addressOffset>0x22b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1199</name>
        <addressOffset>0x22bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1200</name>
        <addressOffset>0x22c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1201</name>
        <addressOffset>0x22c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1202</name>
        <addressOffset>0x22c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1203</name>
        <addressOffset>0x22cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1204</name>
        <addressOffset>0x22d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1205</name>
        <addressOffset>0x22d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1206</name>
        <addressOffset>0x22d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1207</name>
        <addressOffset>0x22dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1208</name>
        <addressOffset>0x22e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1209</name>
        <addressOffset>0x22e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1210</name>
        <addressOffset>0x22e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1211</name>
        <addressOffset>0x22ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1212</name>
        <addressOffset>0x22f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1213</name>
        <addressOffset>0x22f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1214</name>
        <addressOffset>0x22f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1215</name>
        <addressOffset>0x22fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1216</name>
        <addressOffset>0x2300</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1217</name>
        <addressOffset>0x2304</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1218</name>
        <addressOffset>0x2308</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1219</name>
        <addressOffset>0x230c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1220</name>
        <addressOffset>0x2310</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1221</name>
        <addressOffset>0x2314</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1222</name>
        <addressOffset>0x2318</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1223</name>
        <addressOffset>0x231c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1224</name>
        <addressOffset>0x2320</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1225</name>
        <addressOffset>0x2324</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1226</name>
        <addressOffset>0x2328</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1227</name>
        <addressOffset>0x232c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1228</name>
        <addressOffset>0x2330</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1229</name>
        <addressOffset>0x2334</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1230</name>
        <addressOffset>0x2338</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1231</name>
        <addressOffset>0x233c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1232</name>
        <addressOffset>0x2340</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1233</name>
        <addressOffset>0x2344</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1234</name>
        <addressOffset>0x2348</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1235</name>
        <addressOffset>0x234c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1236</name>
        <addressOffset>0x2350</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1237</name>
        <addressOffset>0x2354</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1238</name>
        <addressOffset>0x2358</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1239</name>
        <addressOffset>0x235c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1240</name>
        <addressOffset>0x2360</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1241</name>
        <addressOffset>0x2364</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1242</name>
        <addressOffset>0x2368</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1243</name>
        <addressOffset>0x236c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1244</name>
        <addressOffset>0x2370</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1245</name>
        <addressOffset>0x2374</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1246</name>
        <addressOffset>0x2378</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1247</name>
        <addressOffset>0x237c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1248</name>
        <addressOffset>0x2380</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1249</name>
        <addressOffset>0x2384</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1250</name>
        <addressOffset>0x2388</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1251</name>
        <addressOffset>0x238c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1252</name>
        <addressOffset>0x2390</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1253</name>
        <addressOffset>0x2394</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1254</name>
        <addressOffset>0x2398</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1255</name>
        <addressOffset>0x239c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1256</name>
        <addressOffset>0x23a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1257</name>
        <addressOffset>0x23a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1258</name>
        <addressOffset>0x23a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1259</name>
        <addressOffset>0x23ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1260</name>
        <addressOffset>0x23b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1261</name>
        <addressOffset>0x23b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1262</name>
        <addressOffset>0x23b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1263</name>
        <addressOffset>0x23bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1264</name>
        <addressOffset>0x23c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1265</name>
        <addressOffset>0x23c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1266</name>
        <addressOffset>0x23c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1267</name>
        <addressOffset>0x23cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1268</name>
        <addressOffset>0x23d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1269</name>
        <addressOffset>0x23d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1270</name>
        <addressOffset>0x23d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1271</name>
        <addressOffset>0x23dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1272</name>
        <addressOffset>0x23e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1273</name>
        <addressOffset>0x23e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1274</name>
        <addressOffset>0x23e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1275</name>
        <addressOffset>0x23ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1276</name>
        <addressOffset>0x23f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1277</name>
        <addressOffset>0x23f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1278</name>
        <addressOffset>0x23f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1279</name>
        <addressOffset>0x23fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1280</name>
        <addressOffset>0x2400</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1281</name>
        <addressOffset>0x2404</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1282</name>
        <addressOffset>0x2408</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1283</name>
        <addressOffset>0x240c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1284</name>
        <addressOffset>0x2410</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1285</name>
        <addressOffset>0x2414</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1286</name>
        <addressOffset>0x2418</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1287</name>
        <addressOffset>0x241c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1288</name>
        <addressOffset>0x2420</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1289</name>
        <addressOffset>0x2424</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1290</name>
        <addressOffset>0x2428</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1291</name>
        <addressOffset>0x242c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1292</name>
        <addressOffset>0x2430</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1293</name>
        <addressOffset>0x2434</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1294</name>
        <addressOffset>0x2438</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1295</name>
        <addressOffset>0x243c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1296</name>
        <addressOffset>0x2440</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1297</name>
        <addressOffset>0x2444</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1298</name>
        <addressOffset>0x2448</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1299</name>
        <addressOffset>0x244c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1300</name>
        <addressOffset>0x2450</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1301</name>
        <addressOffset>0x2454</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1302</name>
        <addressOffset>0x2458</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1303</name>
        <addressOffset>0x245c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1304</name>
        <addressOffset>0x2460</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1305</name>
        <addressOffset>0x2464</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1306</name>
        <addressOffset>0x2468</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1307</name>
        <addressOffset>0x246c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1308</name>
        <addressOffset>0x2470</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1309</name>
        <addressOffset>0x2474</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1310</name>
        <addressOffset>0x2478</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1311</name>
        <addressOffset>0x247c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1312</name>
        <addressOffset>0x2480</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1313</name>
        <addressOffset>0x2484</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1314</name>
        <addressOffset>0x2488</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1315</name>
        <addressOffset>0x248c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1316</name>
        <addressOffset>0x2490</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1317</name>
        <addressOffset>0x2494</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1318</name>
        <addressOffset>0x2498</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1319</name>
        <addressOffset>0x249c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1320</name>
        <addressOffset>0x24a0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1321</name>
        <addressOffset>0x24a4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1322</name>
        <addressOffset>0x24a8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1323</name>
        <addressOffset>0x24ac</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1324</name>
        <addressOffset>0x24b0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1325</name>
        <addressOffset>0x24b4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1326</name>
        <addressOffset>0x24b8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1327</name>
        <addressOffset>0x24bc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1328</name>
        <addressOffset>0x24c0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1329</name>
        <addressOffset>0x24c4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1330</name>
        <addressOffset>0x24c8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1331</name>
        <addressOffset>0x24cc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1332</name>
        <addressOffset>0x24d0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1333</name>
        <addressOffset>0x24d4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1334</name>
        <addressOffset>0x24d8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1335</name>
        <addressOffset>0x24dc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1336</name>
        <addressOffset>0x24e0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1337</name>
        <addressOffset>0x24e4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1338</name>
        <addressOffset>0x24e8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1339</name>
        <addressOffset>0x24ec</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1340</name>
        <addressOffset>0x24f0</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1341</name>
        <addressOffset>0x24f4</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1342</name>
        <addressOffset>0x24f8</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1343</name>
        <addressOffset>0x24fc</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1344</name>
        <addressOffset>0x2500</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1345</name>
        <addressOffset>0x2504</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1346</name>
        <addressOffset>0x2508</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1347</name>
        <addressOffset>0x250c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1348</name>
        <addressOffset>0x2510</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1349</name>
        <addressOffset>0x2514</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1350</name>
        <addressOffset>0x2518</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1351</name>
        <addressOffset>0x251c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1352</name>
        <addressOffset>0x2520</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1353</name>
        <addressOffset>0x2524</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1354</name>
        <addressOffset>0x2528</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1355</name>
        <addressOffset>0x252c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1356</name>
        <addressOffset>0x2530</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1357</name>
        <addressOffset>0x2534</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1358</name>
        <addressOffset>0x2538</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1359</name>
        <addressOffset>0x253c</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1360</name>
        <addressOffset>0x2540</addressOffset>
        <size>0x20</size>
      </register>
      <register>
        <name>LUT.1361</name>
        <addressOffset>0x2544</addressOffset>
        <size>0x20</size>
      </register>
